# Water Services Database Query Solutions

In [1]:
%load_ext sql

In [10]:
# Create connection to the md_water_services database
%sql mysql+mysqlconnector://root:password@localhost:3306/md_water_services

## Show all the tables on the Water Service Database

In [11]:
%%sql 

SHOW TABLES;

 * mysql+mysqlconnector://root:***@localhost:3306/md_water_services
12 rows affected.

[('auditor_report',),
 ('combined_analysis_table',),
 ('data_dictionary',),
 ('employee',),
 ('global_water_access',),
 ('incorrect_records',),
 ('location',),
 ('project_progress',),
 ('visits',),
 ('water_quality',),
 ('water_source',),
 ('well_pollution',)]

### Question 1

#### What is the address of Bello Azibo?

In [15]:
%%sql

SELECT address 
FROM employee
WHERE employee_name = 'Bello Azibo';

 * mysql+mysqlconnector://root:***@localhost:3306/md_water_services
1 rows affected.

[('129 Ziwa La Kioo Road',)]

### Question 2

#### What is the name and phone number of our Microbiologist?

In [16]:
%%sql

SELECT employee_name, phone_number
FROM employee
WHERE position = 'Micro Biologist';

 * mysql+mysqlconnector://root:***@localhost:3306/md_water_services
1 rows affected.

[('Vuyisile Ghadir', '+99712584936')]

### Question 3

#### What is the source_id of the water source shared by the most number of people?

In [23]:
%%sql

SELECT source_id
FROM water_source
ORDER BY number_of_people_served DESC
LIMIT 1;

 * mysql+mysqlconnector://root:***@localhost:3306/md_water_services
1 rows affected.

[('AkRu05603224',)]

### Question 4

#### What is the population of Maji Ndogo?

In [21]:
%%sql

SELECT pop_n
FROM global_water_access 
WHERE name = 'Maji Ndogo'
LIMIT 1;

 * mysql+mysqlconnector://root:***@localhost:3306/md_water_services
1 rows affected.

[(27628.1,)]

### Question 5

#### Which SQL query returns records of employees who are Civil Engineers residing in Dahabu or living on an avenue?

In [24]:
%%sql

SELECT *
FROM employee
WHERE position = 'Civil Engineer' AND (province_name = 'Dahabu' OR address LIKE '%Avenue%');

 * mysql+mysqlconnector://root:***@localhost:3306/md_water_services
2 rows affected.

[(71, 'Jengo Rudo', '+99317854629', 'jengo.rudo@ndogowater.gov', '33 Angélique Kidjo Avenue', 'Amanzi', 'Dahabu', 'Civil Engineer'),
 (81, 'Nia Vuyisile', '+99273841596', 'nia.vuyisile@ndogowater.gov', '52 Moroni Avenue', 'Sokoto', 'Rural', 'Civil Engineer')]

### Question 6

**Create a query to identify potentially suspicious field workers based on an anonymous tip.**

This is the description we are given:

- The employee’s phone number contained the digits 86 or 11. 
- The employee’s last name started with either an A or an M. 
- The employee was a Field Surveyor.**

In [25]:
%%sql

SELECT employee_name
FROM employee
WHERE 
    (phone_number LIKE '%86%'
    OR phone_number LIKE '%11%')
    AND (employee_name LIKE '% A%' 
    OR employee_name LIKE '% M%')
    AND position = 'Field Surveyor';

 * mysql+mysqlconnector://root:***@localhost:3306/md_water_services
2 rows affected.

[('Bello Azibo',), ('Zuriel Matembo',)]

### Question 7

#### Write a query that will identify the records the top 10 records with a quality score of 10, visited more than once showing the 10 most visited?

In [27]:
%%sql

SELECT * 
FROM water_quality 
WHERE visit_count >= 2 AND subjective_quality_score = 10
ORDER BY visit_count DESC
LIMIT 10;

 * mysql+mysqlconnector://root:***@localhost:3306/md_water_services
10 rows affected.

[(630, 10, 8),
 (1153, 10, 8),
 (1185, 10, 8),
 (1143, 10, 8),
 (398, 10, 8),
 (1263, 10, 8),
 (959, 10, 8),
 (741, 10, 8),
 (749, 10, 8),
 (476, 10, 8)]

### Question 8

#### Write the SQL query to correct the phone number for the employee named 'Bello Azibo'. The correct number is +99643864786

In [30]:
%%sql

UPDATE employee
SET phone_number = '+99643864786'
WHERE employee_name = 'Bello Azibo';

 * mysql+mysqlconnector://root:***@localhost:3306/md_water_services
1 rows affected.

[]

### Question 9

#### Which well pollution samples are identified with either Cryptosporidium parasite or general biological contamination, or are labeled as 'Clean' yet have a biological contamination level above the minimal threshold?

In [32]:
%%sql

SELECT * 
FROM well_pollution
WHERE description
IN ('Parasite: Cryptosporidium', 'biologically contaminated')
OR (results = 'Clean' AND biological > 0.01)
LIMIT 10;

 * mysql+mysqlconnector://root:***@localhost:3306/md_water_services
10 rows affected.

[('SoRu36278224', datetime.datetime(2021, 1, 4, 12, 24), 'Parasite: Cryptosporidium', 0.0, 485.162, 'Contaminated: Biological'),
 ('HaDe16499224', datetime.datetime(2021, 1, 7, 12, 53), 'Parasite: Cryptosporidium', 0.0, 485.162, 'Contaminated: Biological'),
 ('KiRu26584224', datetime.datetime(2021, 1, 8, 13, 10), 'Parasite: Cryptosporidium', 0.0, 485.162, 'Contaminated: Biological'),
 ('KiZu31025224', datetime.datetime(2021, 1, 10, 14, 36), 'Parasite: Cryptosporidium', 0.0, 485.162, 'Contaminated: Biological'),
 ('HaRu17300224', datetime.datetime(2021, 1, 16, 16, 47), 'Parasite: Cryptosporidium', 0.0, 485.162, 'Contaminated: Biological'),
 ('SoRu35543224', datetime.datetime(2021, 1, 18, 9, 49), 'Parasite: Cryptosporidium', 0.0, 485.162, 'Contaminated: Biological'),
 ('KiRu26626224', datetime.datetime(2021, 1, 23, 10, 27), 'Parasite: Cryptosporidium', 0.0, 485.162, 'Contaminated: Biological'),
 ('HaRu19424224', datetime.datetime(2021, 1, 29, 14, 15), 'Parasite: Cryptosporidium', 0.0, 485.162, 'Contaminated: Biological'),
 ('KiAm22282224', datetime.datetime(2021, 1, 30, 16, 28), 'Parasite: Cryptosporidium', 0.0, 485.162, 'Contaminated: Biological'),
 ('KiRu26616224', datetime.datetime(2021, 2, 5, 13, 48), 'Parasite: Cryptosporidium', 0.0, 485.162, 'Contaminated: Biological')]